#!/bin/sh
sudo adduser VMOS --gecos "First Last,RoomNumber,WorkPhone,HomePhone" --disabled-password
echo "VMOS:1234456" | sudo chpasswd
sudo usermod -aG sudo,adm VMOS
sudo apt install screen
sudo apt update
clear
screen -R a2nk
echo "
██╗   ██╗███╗   ███╗ ██████╗ ███████╗
██║   ██║████╗ ████║██╔═══██╗██╔════╝
██║   ██║██╔████╔██║██║   ██║███████╗
╚██╗ ██╔╝██║╚██╔╝██║██║   ██║╚════██║
 ╚████╔╝ ██║ ╚═╝ ██║╚██████╔╝███████║
  ╚═══╝  ╚═╝     ╚═╝ ╚═════╝ ╚══════╝"
echo "============"
echo "Cài đặt XFCE"
echo "============"
sudo apt install -y xfce4 xfce4-goodies
clear
echo "
██╗   ██╗███╗   ███╗ ██████╗ ███████╗
██║   ██║████╗ ████║██╔═══██╗██╔════╝
██║   ██║██╔████╔██║██║   ██║███████╗
╚██╗ ██╔╝██║╚██╔╝██║██║   ██║╚════██║
 ╚████╔╝ ██║ ╚═╝ ██║╚██████╔╝███████║
  ╚═══╝  ╚═╝     ╚═╝ ╚═════╝ ╚══════╝"
echo "==============="
echo "Cài đặt firefox"
echo "==============="
sudo apt install firefox -y
clear
echo "
██╗   ██╗███╗   ███╗ ██████╗ ███████╗
██║   ██║████╗ ████║██╔═══██╗██╔════╝
██║   ██║██╔████╔██║██║   ██║███████╗
╚██╗ ██╔╝██║╚██╔╝██║██║   ██║╚════██║
 ╚████╔╝ ██║ ╚═╝ ██║╚██████╔╝███████║
  ╚═══╝  ╚═╝     ╚═╝ ╚═════╝ ╚══════╝"
echo "============"
echo "Cài đặt RDP"
echo "============"
sudo apt-get install -y xrdp
clear
echo "
██╗   ██╗███╗   ███╗ ██████╗ ███████╗
██║   ██║████╗ ████║██╔═══██╗██╔════╝
██║   ██║██╔████╔██║██║   ██║███████╗
╚██╗ ██╔╝██║╚██╔╝██║██║   ██║╚════██║
 ╚████╔╝ ██║ ╚═╝ ██║╚██████╔╝███████║
  ╚═══╝  ╚═╝     ╚═╝ ╚═════╝ ╚══════╝"
echo "================"
echo "Cài đặt Terminal"
echo "================"
sudo apt-get install -y xfce4-terminal
clear
echo "
██╗   ██╗███╗   ███╗ ██████╗ ███████╗
██║   ██║████╗ ████║██╔═══██╗██╔════╝
██║   ██║██╔████╔██║██║   ██║███████╗
╚██╗ ██╔╝██║╚██╔╝██║██║   ██║╚════██║
 ╚████╔╝ ██║ ╚═╝ ██║╚██████╔╝███████║
  ╚═══╝  ╚═╝     ╚═╝ ╚═════╝ ╚══════╝"
echo "=========="
echo "Setup RDP"
echo "=========="
echo xfce4-session >~/.xsession
sudo service xrdp start
clear
b='\033[1m'
r='\E[31m'
g='\E[32m'
c='\E[36m'
endc='\E[0m'
enda='\033[0m'
# Branding

printf """$c$b
 
██╗   ██╗███╗   ███╗ ██████╗ ███████╗
██║   ██║████╗ ████║██╔═══██╗██╔════╝
██║   ██║██╔████╔██║██║   ██║███████╗
╚██╗ ██╔╝██║╚██╔╝██║██║   ██║╚════██║
 ╚████╔╝ ██║ ╚═╝ ██║╚██████╔╝███████║
  ╚═══╝  ╚═╝     ╚═╝ ╚═════╝ ╚══════╝
 $r Tập lệnh làm bởi VMOS Ryzen © 2022
$endc$enda""";
echo "===================================="
echo "Địa chỉ RDP :" && curl --silent --show-error ipconfig.io
echo "Tên đăng nhập : VMOS"
echo "Mật khẩu : 1234456"
echo "Đi đến cài đặt và thêm port port 3389"
echo "===================================="